
/*******************************Copyright (c)***************************/
/*
 *                         深圳铭之光电子技术有限公司
 *                         工　　　　　程　　　　　部
 *                         http://www.sinocomopto.com
 */
/***********************************************************************/
#include  "_Include.h"

/***********************************************************************/


/*
 *功能：
 *入口：
 *出口：
 *备注：
 *函数性质：
 */
int32s Alti_Baro2High (int32u baro)
{	int32u i;
	int32u j;
	
	
	if(baro<30000) baro= 30000;
	if(baro>110000)baro=110000;
	     if(baro<34900)	{	j=15464000;	i=210;	}
	else if(baro<40050)	{	j=14626000;	i=186;	}
 	else if(baro<45000)	{	j=13905000;	i=168;	}
 	else if(baro<49900)	{	j=13275000;	i=154;	}
 	else if(baro<54900)	{	j=12676000;	i=142;	}
 	else if(baro<60000)	{	j=12127000;	i=132;	}
 	else if(baro<65000)	{	j=11587000;	i=123;	}
 	else if(baro<70000)	{	j=11132000;	i=116;	}
 	else if(baro<74800)	{	j=10642000;	i=109;	}
 	else if(baro<80000)	{	j=10268000;	i=104;	}
 	else if(baro<85000)	{	j= 9788000;	i=98;	}
 	else if(baro<89750)	{	j= 9448000;	i=94;	}
 	else if(baro<94750)	{	j= 9089000;	i=90;	}
 	else if(baro<100600){	j= 8710000;	i=86;	}
 	else if(baro<110000){	j= 8207000;	i=81;	}
	return ((int32s)(j-baro*i)/100);
}

/*
 *功能：
 *入口：
 *出口：
 *备注：
 *函数性质：
 */
int32s Alti_High2Pres (int32s h)
{	int32u i=0,j=0;
	
	
	h=h*100;
	if(h>9164000)h=9164000;
	if(h<-703000)h=-703000;
	     if(h>8135000)	{	j=15464000;	i=210;	}
	else if(h>7176700)	{	j=14626000;	i=186;	}
 	else if(h>6345000)	{	j=13905000;	i=168;	}
 	else if(h>5590400)	{	j=13275000;	i=154;	}
 	else if(h>4880200)	{	j=12676000;	i=142;	}
 	else if(h>4207000)	{	j=12127000;	i=132;	}
 	else if(h>3592000)	{	j=11587000;	i=123;	}
 	else if(h>3012000)	{	j=11132000;	i=116;	}
 	else if(h>2488800)	{	j=10642000;	i=109;	}
 	else if(h>1948000)	{	j=10268000;	i=104;	}
 	else if(h>1458000)	{	j=9788000;	i=98;	}
 	else if(h>1011500)	{	j=9448000;	i=94;	}
 	else if(h>561500 )	{	j=9089000;	i=90;	}
 	else if(h>58400  )	{	j=8710000;	i=86;	}
 	else if(h>=-703000)	{	j=8207000;	i=81;	}
	return(j-h)/i;
}
