
/*******************************Copyright (c)***************************/
/*
 *                         深圳铭之光电子技术有限公司
 *                         工　　　　　程　　　　　部
 *                         http://www.sinocomopto.com
 */
/***********************************************************************/
#include	"_Type.h"
/***********************************************************************/
#ifndef __INIT_H__
	#define __INIT_H__
	/*-----宏定义---------------------*/
	/*-----结构体数据类型定义---------*/
	/*-----常量（表格等）声明---------*/
	/*-----函数声明-------------------*/
	void Init_GpioPort(void);
	void Init_PowerManager(void);
	void Init_PowerOff(void);
	void Init_PowerOn(void);
	
	void Init_All (void);
	
	void Init_GpioPortRe (void);
#endif
/***********************************************************************/
/***********************************************************************/
/***********************************************************************/
#ifdef   __INIT_C__
#define  INIT_EXT
#else
#define  INIT_EXT  extern
#endif
/*-------------变量声明--------------*/


