
/*******************************Copyright (c)***************************/
/*
 *                         深圳铭之光电子技术有限公司
 *                         工　　　　　程　　　　　部
 *                         http://www.sinocomopto.com
 */
/***********************************************************************/
#include	"_Type.h"
/***********************************************************************/
#ifndef __TWI_SLAVE_H__
	#define __TWI_SLAVE_H__
	/*-----宏定义---------------------*/
	/*-----结构体数据类型定义---------*/
	/*-----常量（表格等）声明---------*/
	/*-----函数声明-------------------*/
	void Twi_SlaveInit (void);
	void Twi_TransceiverStaWithData (int8u* buf,int8u n);
	int8u Twi_GetDataFromTransceiver (int8u* buf,int8u n);
	
#endif
/***********************************************************************/
/***********************************************************************/
/***********************************************************************/
#ifdef   __TWI_SLAVE_C__
#define  TWI_SLAVE_EXT
#else
#define  TWI_SLAVE_EXT  extern
#endif
/*-------------变量声明--------------*/



